Locale.extend('ar', 'validation', {
    'number': 'رقم غير صحيح',
    'minLength': 'يجب إدخال  %d حرف على الاقل',
    'length': 'عدد الحروف المسموح بها لهذا الحقل هي %d حرف',
    'maxLength': 'أقصى عدد حروف مسموح به هو %d حرف',
    'min': 'أقل قيمة مسموح بها %d',
    'max': 'أعلى قيمة مسموح بها %d',
    'invalid-value': 'قمية خائطة',
    'email': 'بريد إلكتروني خاطئ',
    'required': 'هذا الحقل مطلوب',
    'match': 'هذا الحقل غير مطابق إلى  %s',
    'is': {
        'mobileNumber': {
            'eg': 'رقم موبايل خاططئ',
        },
    },
});